package core.mate.academy.service;

import core.mate.academy.model.Machine;
import java.util.List;
/**
 * Інтерфейс `MachineService` надає методи для роботи з машинами.
 * Він дозволяє отримувати машини певних типів, заповнювати список машинами
 * і розпочинати робочий процес для заданого списку машин.
 *
 * @param <T> тип машин, підтримуваних сервісом
 */
public interface MachineService<T extends Machine> {
    /**
     * Отримує список машин певного типу.
     *
     * @param type клас, що представляє тип машин для отримання
     * @return список машин певного типу
     */
    List<T> getAll(Class<? extends T> type);
    /**
     * Заповнює заданий список машинами певного типу.
     * Розмір списку залишається незмінним, але його елементи замінюються
     * новими екземплярами машин певного типу.
     *
     * @param machines    список, який потрібно заповнити машинами
     * @param value тип машин, яким заповнюється список
     */
    void fill(List<? super T> machines, T value);

    /**
     * Розпочинає робочий процес для заданого списку машин.
     * Цей метод виконується, якщо переданий список машин містить
     * екземпляри машин відповідного типу.
     *
     * @param machines список машин для розпочатку роботи
     */
    void startWorking(List<? extends T> machines);
}
